Repository: endisha/maps-woocommerce
Catalog: src/languages/maps-woocommerce-*.po
Languages: ar

source: Maps for WooCommerce Settings
ar: إعداد خرائط جوجل لمتجر WooCommerce

source: Configure Google Maps for your WooCommerce store.
ar: قم بتكوين إعدادات خرائط Google لمتجر WooCommerce الخاص بك.

source: Integrate Google Maps with WooCommerce for easy location selection during checkout and in user account addresses to elevate the shopping experience.
ar: استخدم خرائط Google مع متجر WooCommerce لسهولة اختيار مكان المستخدم أثناء اتمام الطلب وفي عناوين الحساب للارتقاء بتجربة التسوق.

source: Activate
ar: تفعيل

source: Enable or disable the maps for WooCommerce.
ar: تمكين أو تعطيل الخرائط لـ WooCommerce.

source: API Key
ar: مفتاح API

source: Google Maps API Key.
ar: مفتاح API لخرائط جوجل.

source: The plugin will not be activated until a valid key is entered.
ar: لن يتم تنشيط الخرائط حتى يتم إدخال مفتاح صحيح.

source: Map style and display settings
ar: نمط الخريطة وإعدادات العرض

source: Set as Required
ar: تعيين كحقل مطلوب

source: Make it mandatory for users to select a location on the map before proceeding to checkout and completing payment.
ar: اجعل من الضروري للمستخدمين تحديد الموقع على الخريطة قبل متابعة الطلب وإكمال الدفع.

source: Auto Detect User Location
ar: التحديد التلقائي

source: Automatically detect the user's location if they haven't saved their coordinates yet.
ar: تحديد مكان المستخدم على الخريطة تلقائيًا في صفحة إكمال الطلب والعناوين إذا لم يدخل ويحفظ مكانه الحالي.

source: Requires location access permission to automatically determine the user's current location.
ar: يتطلب إذن الوصول إلى الموقع لتحديد المكان الحالي للمستخدم تلقائيًا.

source: Map Display Location
ar: تحديد مكان عرض الخريطة

source: Choose the address section where you want the map to be displayed.
ar: اختر قسم العناوين الذي تريد عرض الخريطة فيه.

source: Billing Address
ar: عنوان الفوترة

source: Shipping Address
ar: عنوان الشحن

source: Map Style
ar: تخصيص الشكل

source: Choose the map style you prefer to display.
ar: اختر نمط الخريطة الذي تفضل عرضه.

source: Map Zoom Level
ar: مستوى تكبير/تصغير الخريطة

source: Set the zoom level for the map.
ar: ضبط مستوى التكبير/التصغير للخريطة.

source: Map Marker
ar: شكل دبوس الخريطة

source: Select a marker style for your map.
ar: اختر نمطًا لعلامة وشكل دبوس الخريطة.

source: Default Marker
ar: الافتراضي

source: Blue Marker
ar: أزرق

source: Green Marker
ar: أخضر

source: Yellow Marker
ar: أصفر

source: Purple Marker
ar: بنفسجي

source: Pink Marker
ar: زهري

source: + Custom
ar: + مخصص

source: Checkout Page
ar: صفحة إتمام الطلب

source: Show during the checkout page in billing or shipping sections based on the [Map Display Location] setting.
ar: اظهار في صفحة الدفع في أقسام الفواتير أو الشحن بناءً على إعداد [تحديد مكان عرض الخريطة].

source: Address Account Page
ar: صفحة عناوين المستخدم

source: Show in the user account - address page under billing or shipping sections based on the [Map Display Location] setting.
ar: اعرض في حساب المستخدم - صفحة العنوان ضمن أقسام الفواتير أو الشحن بناءً على إعداد [تحديد مكان عرض الخريطة].

source: Order Details Page
ar: صفحة عرض الطلب

source: Show in the order details page.
ar: اعرض في صفحة تفاصيل الطلب للمستخدم.

source: Admin Order Details Page
ar: صفحة عرض الطلب (الإدارة)

source: Show in the admin order details page.
ar: اعرض في صفحة تفاصيل الطلب في لوحة تحكم المشرف.

source: Profile Page
ar: الملف الشخصي (الإدارة)

source: Show in the user profile when editing the user in the admin.
ar: اعرض في ملف تعريف المستخدم عند تحرير المستخدم في لوحة تحكم المشرف.

source: Settings
ar: الإعدادات

source: Maps for WooCommerce
ar: خرائط جوجل WooCommerce

source: %s requires %s to be activated.
ar: يتطلب %s أن تكون الملحق %s مفعل.

source: Google Maps for WooCommerce
ar: خرائط جوجل

source: Token mismatch
ar: رمز الصفحة غير مطابق، يرجى تحديث الصفحة

source: Order Location Map
ar: خريطة مكان الطلب

source: Location
ar: المكان على الخريطة

source: Drag the marker to choose user location.
ar: قم بسحب و تحريك الدبوس لتحديد مكان المستخدم علي الخريطة.

source: Google Maps API key is missing.
ar: مفتاح API لخرائط جوجل غير موجود.

source: Google Maps API key is not valid.
ar: مفتاح API لخرائط جوجل غير صحيح.

source: The default latitude or longitude coordinates are invalid.
ar: إحداثيات خط العرض أو خط الطول الافتراضية غير صحيحة.

source: Address
ar: العنوان

source: Get My Location
ar: تحديد مكاني الحالي

source: Location access denied. To use this feature, please enable location services in your browser settings.
ar: تم رفض الوصول التلقائي إلى مكانك الحالي. لاستخدام هذه الميزة، الرجاء تمكين خدمات الموقع من إعدادات المتصفح الخاص بك.

source: The coordinates you entered are invalid. Please ensure they are within the valid range and try again.
ar: الاحداثيات التي أدخلتها غير صحيحة. يرجى التأكد من أنها ضمن النطاق الصحيح وحاول مرة أخرى.

source: The map location is missing.
ar: لم تقم بتحديد المكان على الخريطة.

source: Custom Marker
ar: تخصيص

source: Enter a custom marker image URL. The recommended dimensions are 40x40 pixels.
ar: أدخل عنوان URL لصورة العلامة المخصصة. الأبعاد الموصى بها هي 40x40 بكسل.

source: No map data available for this order.
ar: لا توجد بيانات متاحة للخريطة لهذا الطلب.

source: Use Default Coordinates
ar: استخدم الإحداثيات الافتراضية

source: Use default coordinates for users without saved coordinates
ar: استخدم الإحداثيات الافتراضية للمستخدمين الذين لم يحددوا مكانهم بعد

source: If unchecked, the map will load with zero coordinates.
ar: إذا لم يتم تحديده، فسيتم تحميل الخريطة في ‫المرة الأولي‬ بإحداثيات صفرية.

source: Default Coordinates
ar: الاحداثيات الافتراضية

source: Latitude
ar: خط العرض

source: Longitude
ar: خط الطول

source: Enter the default coordinates to be used during the initial load when the user has not yet saved their coordinates.
ar: أدخل الإحداثيات الافتراضية التي سيتم استخدامها أثناء التحميل الأولي عندما لا يكون للمستخدم إحداثيات مخزنة بعد.

source: Map Preview
ar: معاينة الخريطة

source: Loading map...
ar: تحميل الخريطة ...

source: Drag the marker to define the initial map coordinates.
ar: قم بسحب و تحريك الدبوس لتحديد إحداثيات الخريطة الأولية.

source: The map will appear when an active Google API key is entered.
ar: ستظهر الخريطة عند إدخال مفتاح Google API صحيح.

source: Map Visibility
ar: أماكن ظهور الخريطة

source: This section lets you control where the map appears and displays.
ar: التحكم في مكان ظهور الخريطة وعرضها.

source: (optional)
ar: (اختياري)

source: Drag the marker to choose your location.
ar: قم بسحب و تحريك الدبوس لتحديد مكانك علي الخريطة.
